{
    "Languages": {
        "JavaScript": {
            "Time": "6 years",
            "Description": ""
        }
    },
    "Experiences": [],
    "Body": "I'm a developer who's trying to familiarize themselves with as much as possible in terms of app development. All of my projects involve a great deal of passion, and I go to the lengths to get my vision to come alive. Believe it or not, I got my start in the world of programming from video games. When I was younger I would play games such as Angry Birds, but thought to myself, \"I want to make the levels\". I eventually found that someone had developed a browser based level editor for Angry Birds that would generate the lua scripts which the game utilized to generate the play area of blocks and enemies for these levels. After getting some experience with web development, I was able to make editors for games instead of using someone elses. Many games such as Plants vs. Zombies 2, BTD5, and more I eventually made tools that assist with the creation of these levels to be imported into the game. After that, I began to branch out and started to think of problems that I had or just think of systems that would make processes easier for me. My first tool which could be considered this was called Mario Kart Tour Values, and it was a tool for the game Mario Kart Tour which helped me cross referenced a bunch of information at once. To summarize, every item in that game has a few locations that they are higher scoring on, and the game does not have an easy way to see what else is on those areas. By showing every item that has a bonus on their areas, I could make better decisions about what I wanted to level up in the game. My next few projects over the next couple years were mostly related to Mario Kart Tour, and I made a variety of different apps including a simulator for the games loot system, and a way to view more extensive information about your account. At this current moment in time, I'm occasionally working on a recreation of an old mobile adaption of UNO created by Gameloft which was a game I played a lot in my childhood. I challenged myself to develop the entire game from the actual base game's logic all the way down to the menus and other modes such as tournament mode."
}